Question 4

In [5]:
import pandas as pd
import datetime as dt
df = pd.read_csv('https://raw.githubusercontent.com/jbrownlee/Datasets/master/daily-total-female-births.csv')
df.head()

         Date  Births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [6]:
df['Date'] = df['Date'].astype('datetime64[ns]')

In [9]:
df.insert(2,'Month',df.Date.dt.month)

In [10]:
df

          Date  Births  Month
0   1959-01-01      35      1
1   1959-01-02      32      1
2   1959-01-03      30      1
3   1959-01-04      31      1
4   1959-01-05      44      1
..         ...     ...    ...
360 1959-12-27      37     12
361 1959-12-28      52     12
362 1959-12-29      48     12
363 1959-12-30      55     12
364 1959-12-31      50     12

[365 rows x 3 columns]

In [11]:
df1 = df.groupby('Month')

In [15]:
df1['Births'].sum()

Month
1     1213
2     1148
3     1218
4     1195
5     1208
6     1212
7     1300
8     1351
9     1446
10    1368
11    1350
12    1314
Name: Births, dtype: int64